# 1. IMPORT LIBRARY

In [2]:
from datetime import datetime, timedelta, date
import pandas as pd
import pyodbc

# 2. CONNECT TO SQL SERVER

In [3]:
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=localhost\SQLEXPRESS;"
    "DATABASE=Topic_1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;"
)

<>:3: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
<>:3: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
C:\Users\Hiep\AppData\Local\Temp\ipykernel_20296\2874359373.py:3: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
  "SERVER=localhost\SQLEXPRESS;"

In [4]:
df_cards = pd.read_sql_query(''' 
SELECT *
FROM [topic_1].[dbo].[cards_data_raw]
    ; ''', conn)
df_cards

C:\Users\Hiep\AppData\Local\Temp\ipykernel_20296\2584845497.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_cards = pd.read_sql_query('''

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,True,2,24295.0,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,True,2,21968.0,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,True,2,46414.0,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,False,1,12400.0,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,True,1,28.0,09/2008,2009,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6141,5361,185,Amex,Credit,300609782832003,01/2024,663,True,1,6900.0,11/2000,2013,No
6142,2711,185,Visa,Credit,4718517475996018,01/2021,492,True,2,5700.0,04/2012,2012,No
6143,1305,1007,Mastercard,Credit,5929512204765914,08/2020,237,False,2,9200.0,02/2012,2012,No
6144,743,1110,Mastercard,Debit,5589768928167462,01/2020,630,True,1,28074.0,01/2020,2020,No
6145,3199,1110,Visa,Credit,4994011318343994,12/2020,120,True,1,14400.0,05/2017,2017,No

In [6]:
# tạo df_transactions + map fraud labels from json file to transactions data
import json

json_path = r"D:\Data Analyst VTI\5. Python\Topic 1. Financial Transactions Dataset Analytics\Topic 1. Financial Transactions Dataset Analytics (cut)\train_fraud_labels.json"

# Đọc dictionary từ JSON
with open(json_path, "r") as f:
    data = json.load(f)

labels_dict = data["target"]

df_transactions = pd.read_sql_query(''' 
SELECT *
FROM [topic_1].[dbo].[transactions_2012_sample_raw]
    ; ''', conn)

# Lấy label cho mỗi id
df_transactions["fraud_label"] = df_transactions["id"].astype(str).map(labels_dict)

print(df_transactions)

C:\Users\Hiep\AppData\Local\Temp\ipykernel_20776\3488322277.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_transactions = pd.read_sql_query('''

              id                date  client_id  card_id  amount  \
0       10537103 2012-01-01 00:00:00       1697     4306    44.0
1       10537104 2012-01-01 00:01:00       1909     5640   814.0
2       10537105 2012-01-01 00:03:00        641     5151  6206.0
3       10537106 2012-01-01 00:07:00        351     4512   342.0
4       10537108 2012-01-01 00:08:00        900     1238  3857.0
...          ...                 ...        ...      ...     ...
899995  11634128 2012-09-06 20:14:00       1237     5163  4636.0
899996  11634129 2012-09-06 20:15:00        427      269  4843.0
899997  11634130 2012-09-06 20:15:00       1075     4761  2971.0
899998  11634131 2012-09-06 20:15:00       1079     5826  6912.0
899999  11634132 2012-09-06 20:16:00        804     5986  5744.0

                  use_chip  merchant_id     merchant_city merchant_state  \
0        Swipe Transaction        61968           Clinton             MI
1        Swipe Transaction        37074       Los Angeles             CA
2        Swipe Transaction        26549          Columbus             OH
3        Swipe Transaction         3864          Flushing             NY
4        Swipe Transaction        36500       Panama City             FL
...                    ...          ...               ...            ...
899995  Online Transaction        96246            ONLINE           None
899996   Swipe Transaction        11471        Cookeville             TN
899997  Online Transaction        47399            ONLINE           None
899998   Swipe Transaction        84758  Rockville Centre             NY
899999   Swipe Transaction        36934     Bowling Green             KY

             zip   mcc errors fraud_label
0       492360.0  5912   None          No
1       900070.0  5813   None         NaN
2       432280.0  5912   None          No
3       113550.0  5813   None         NaN
4       324010.0  5812   None          No
...          ...   ...    ...         ...
899995       NaN  4784   None         NaN
899996  385010.0  5655   None          No
899997       NaN  5815   None          No
899998  115700.0  5813   None         NaN
899999  421010.0  7538   None         NaN

[900000 rows x 13 columns]

In [12]:
df_users = pd.read_sql_query(''' 
SELECT *
FROM [topic_1].[dbo].[users_data_raw]
    ; ''', conn)
df_users

C:\Users\Hiep\AppData\Local\Temp\ipykernel_20296\867228193.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_users = pd.read_sql_query('''

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,3415.0,-11776.0,29278.0,59696.0,127613.0,787,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,4076.0,-7374.0,37891.0,77254.0,191349.0,701,5
2,1718,81,67,1938,11,Female,766 Third Drive,3402.0,-11789.0,22681.0,33483.0,196.0,698,5
3,708,63,63,1957,1,Female,3 Madison Street,4071.0,-7399.0,163145.0,249925.0,202328.0,722,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,3776.0,-12244.0,53797.0,109687.0,183855.0,675,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,986,32,70,1987,7,Male,6577 Lexington Lane,4065.0,-7358.0,23550.0,48010.0,87837.0,703,3
1996,1944,62,65,1957,11,Female,2 Elm Drive,3895.0,-8454.0,24218.0,49378.0,104480.0,740,4
1997,185,47,67,1973,1,Female,276 Fifth Boulevard,4066.0,-7419.0,15175.0,30942.0,71066.0,779,3
1998,1007,66,60,1954,2,Male,259 Valley Boulevard,4024.0,-7692.0,25336.0,54654.0,27241.0,618,1
1999,1110,21,60,1998,11,Female,472 Ocean View Street,4286.0,-7148.0,32325.0,65909.0,181261.0,673,2

# 3. CLEANING DATA

## 3.1 Remove Duplicates

In [8]:
df_cards.duplicated().sum()

np.int64(0)

In [9]:
df_transactions.duplicated().sum()

np.int64(0)

In [10]:
df_users.duplicated().sum()

np.int64(0)

## 3.2 Checking the types of data

In [32]:
df_cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   bool
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   float64
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: bool(1), float64(1), int64(6), object(5)
memory usage: 582.3+ KB

In [5]:
df_cards[df_cards['cvv']<100]

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,True,1,28.0,09/2008,2009,No
7,3687,1746,Mastercard,Debit,5627220683410948,06/2022,48,True,2,9022.0,07/2003,2015,No
17,5621,708,Visa,Debit,4032240655674503,06/2022,53,True,1,132439.0,11/2010,2011,No
20,27,68,Visa,Credit,4099623033306950,09/2021,74,True,2,9900.0,01/2002,2019,No
37,138,1094,Visa,Debit,4556928160477229,06/2023,64,True,2,2365.0,01/2007,2009,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6071,171,7,Mastercard,Debit,5673440794177682,04/2023,44,False,2,21274.0,01/2008,2009,No
6085,2546,1805,Mastercard,Credit,5541745788882180,02/2022,58,False,1,3800.0,04/2007,2007,No
6098,3752,1528,Visa,Credit,4784666596890935,02/2022,50,True,2,7700.0,07/2005,2015,No
6127,3488,391,Mastercard,Debit,5021628982108623,08/2024,87,True,1,11812.0,06/2010,2010,No
6132,1765,588,Mastercard,Debit,5800888888822204,02/2020,80,True,1,26265.0,02/2020,2020,No

In [6]:
df_cards[['id','client_id','cvv']] = df_cards[['id','client_id','cvv']].astype(str)

In [7]:
def cvv(x):
    if len(x)==2:
        return '0'+x
    elif len(x)==1:
        return "00"+x
    elif len(x)==3 or len(x)==4:
        return x
    
    
df_cards['cvv']=df_cards['cvv'].apply(lambda x : cvv(x))

In [8]:
df_cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   object
 1   client_id              6146 non-null   object
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   object
 7   has_chip               6146 non-null   bool
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   float64
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: bool(1), float64(1), int64(3), object(8)
memory usage: 582.3+ KB

In [14]:
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900000 entries, 0 to 899999
Data columns (total 13 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              900000 non-null  int64
 1   date            900000 non-null  datetime64[ns]
 2   client_id       900000 non-null  int64
 3   card_id         900000 non-null  int64
 4   amount          900000 non-null  float64
 5   use_chip        900000 non-null  object
 6   merchant_id     900000 non-null  int64
 7   merchant_city   900000 non-null  object
 8   merchant_state  799500 non-null  object
 9   zip             793448 non-null  float64
 10  mcc             900000 non-null  int64
 11  errors          14183 non-null   object
 12  fraud_label     603210 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(5), object(5)
memory usage: 89.3+ MB

In [15]:
df_transactions[['id','client_id','card_id','merchant_id']] = df_transactions[['id','client_id','card_id','merchant_id']].astype(str)

In [16]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   float64
 10  yearly_income      2000 non-null   float64
 11  total_debt         2000 non-null   float64
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(5), int64(7), object(2)
memory usage: 218.9+ KB

In [13]:
df_users['id'] = df_users['id'].astype(str)

In [14]:
import numpy as np

In [15]:
df_users[df_users['current_age'] <= 0].shape[0]

0

In [16]:
df_users[df_users['retirement_age'] <= 0].shape[0]

0

## 3.3 Dropping the missing or null values.

In [18]:
df_cards.isnull().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [19]:
df_transactions.isnull().sum()

id                     0
date                   0
client_id              0
card_id                0
amount                 0
use_chip               0
merchant_id            0
merchant_city          0
merchant_state    100500
zip               106552
mcc                    0
errors            885817
fraud_label       296790
dtype: int64

In [21]:
df_transactions[['merchant_state','zip']] = df_transactions[['merchant_state','zip']].fillna('Unknown')

In [23]:
df_transactions['errors'] = df_transactions['errors'].fillna('No error')

In [26]:
df_transactions['fraud_label'] = df_transactions['fraud_label'].fillna('No')

In [27]:
df_transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900000 entries, 0 to 899999
Data columns (total 13 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              900000 non-null  object
 1   date            900000 non-null  datetime64[ns]
 2   client_id       900000 non-null  object
 3   card_id         900000 non-null  object
 4   amount          900000 non-null  float64
 5   use_chip        900000 non-null  object
 6   merchant_id     900000 non-null  object
 7   merchant_city   900000 non-null  object
 8   merchant_state  900000 non-null  object
 9   zip             900000 non-null  object
 10  mcc             900000 non-null  int64
 11  errors          900000 non-null  object
 12  fraud_label     900000 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(10)
memory usage: 89.3+ MB

## 3.4 Remove Irrelevant Data Using Biz Sense

In [17]:
df_users.drop(columns=['latitude', 'longitude'], inplace=True)

## 3.5 Standardize Column Name

In [9]:
df_cards.rename(columns={'id': 'card_id'}, inplace=True)

In [18]:
df_users.rename(columns={'id': 'client_id'}, inplace=True)

# 4. STORE CLEAR DATA INTO SQL SERVER

In [10]:
# --- Connect ---
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=localhost\SQLEXPRESS;"
    "DATABASE=topic_1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;"
)
cursor = conn.cursor()

# --- Map pandas dtype -> SQL Server type ---
dtype_map = lambda dt: "BIGINT" if pd.api.types.is_integer_dtype(dt) else \
                       "DECIMAL(18,4)" if pd.api.types.is_float_dtype(dt) else \
                       "BIT" if pd.api.types.is_bool_dtype(dt) else \
                       "DATETIME" if pd.api.types.is_datetime64_any_dtype(dt) else \
                       "VARCHAR(255)"

table_name = "cards_data_clear"

# --- Drop + Create table ---
cursor.execute(f"IF OBJECT_ID('dbo.{table_name}', 'U') IS NOT NULL DROP TABLE dbo.{table_name}")
cols = ", ".join([f"[{c}] {dtype_map(df_cards[c].dtype)}" for c in df_cards.columns])
cursor.execute(f"CREATE TABLE dbo.{table_name} ({cols})")

# --- Insert rows ---
cursor.fast_executemany = True
cursor.executemany(f"INSERT INTO dbo.{table_name} VALUES ({','.join(['?']*len(df_cards.columns))})", df_cards.values.tolist())
conn.commit()

<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
C:\Users\Hiep\AppData\Local\Temp\ipykernel_20296\542106451.py:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
  "SERVER=localhost\SQLEXPRESS;"

In [50]:
# --- Connect ---
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=localhost\SQLEXPRESS;"
    "DATABASE=topic_1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;"
)
cursor = conn.cursor()

# --- Map pandas dtype -> SQL Server type ---
dtype_map = lambda dt: "BIGINT" if pd.api.types.is_integer_dtype(dt) else \
                       "DECIMAL(18,4)" if pd.api.types.is_float_dtype(dt) else \
                       "BIT" if pd.api.types.is_bool_dtype(dt) else \
                       "DATETIME" if pd.api.types.is_datetime64_any_dtype(dt) else \
                       "VARCHAR(255)"

table_name = "transactions_data_clear"

# --- Drop + Create table ---
cursor.execute(f"IF OBJECT_ID('dbo.{table_name}', 'U') IS NOT NULL DROP TABLE dbo.{table_name}")
cols = ", ".join([f"[{c}] {dtype_map(df_transactions[c].dtype)}" for c in df_transactions.columns])
cursor.execute(f"CREATE TABLE dbo.{table_name} ({cols})")

# --- Insert rows ---
cursor.executemany(f"INSERT INTO dbo.{table_name} VALUES ({','.join(['?']*len(df_transactions.columns))})", df_transactions.values.tolist())
conn.commit()

<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
C:\Users\Hiep\AppData\Local\Temp\ipykernel_20776\2501628908.py:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
  "SERVER=localhost\SQLEXPRESS;"

In [19]:
# --- Connect ---
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=localhost\SQLEXPRESS;"
    "DATABASE=topic_1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;"
)
cursor = conn.cursor()

# --- Map pandas dtype -> SQL Server type ---
dtype_map = lambda dt: "BIGINT" if pd.api.types.is_integer_dtype(dt) else \
                       "DECIMAL(18,4)" if pd.api.types.is_float_dtype(dt) else \
                       "BIT" if pd.api.types.is_bool_dtype(dt) else \
                       "DATETIME" if pd.api.types.is_datetime64_any_dtype(dt) else \
                       "VARCHAR(255)"

table_name = "users_data_clear"

# --- Drop + Create table ---
cursor.execute(f"IF OBJECT_ID('dbo.{table_name}', 'U') IS NOT NULL DROP TABLE dbo.{table_name}")
cols = ", ".join([f"[{c}] {dtype_map(df_users[c].dtype)}" for c in df_users.columns])
cursor.execute(f"CREATE TABLE dbo.{table_name} ({cols})")

# --- Insert rows ---
cursor.fast_executemany = True
cursor.executemany(f"INSERT INTO dbo.{table_name} VALUES ({','.join(['?']*len(df_users.columns))})", df_users.values.tolist())
conn.commit()

<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
<>:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
C:\Users\Hiep\AppData\Local\Temp\ipykernel_20296\2506411153.py:4: SyntaxWarning: "\S" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\S"? A raw string is also an option.
  "SERVER=localhost\SQLEXPRESS;"